var dom = document.getElementById("top100-play");
var myChart = echarts.init(dom);
var app = {};
option = null;
var seriesData = [
    {
        "name": "キズナアイ",
        "value": 133472984
    },
    {
        "name": "キズナアイ(ゲーム)",
        "value": 53098082
    },
    {
        "name": "ミライアカリ",
        "value": 50196323
    },
    {
        "name": "輝夜月(かぐやるな)",
        "value": 49538888
    },
    {
        "name": "電脳少女YouTube…",
        "value": 48733195
    },
    {
        "name": "ヨメミ",
        "value": 17365994
    },
    {
        "name": "月ノ美兎",
        "value": 13916034
    },
    {
        "name": "猫宮ひなた",
        "value": 13674186
    },
    {
        "name": "TEN",
        "value": 13520739
    },
    {
        "name": "ねこみみマスター(バー…",
        "value": 12856801
    },
    {
        "name": "富士葵(ふじあおい)",
        "value": 11000617
    },
    {
        "name": "ときのそら",
        "value": 9094954
    },
    {
        "name": "静凛",
        "value": 8355704
    },
    {
        "name": "バーチャルおばあちゃん…",
        "value": 8016938
    },
    {
        "name": "夢咲楓",
        "value": 7794577
    },
    {
        "name": "ピーナッツくん",
        "value": 6955206
    },
    {
        "name": "樋口楓",
        "value": 6573744
    },
    {
        "name": "Ami Yamato(…",
        "value": 5601665
    },
    {
        "name": "かしこまり",
        "value": 5159170
    },
    {
        "name": "吟醸姉妹/Ginjo …",
        "value": 4710151
    },
    {
        "name": "織田信姫",
        "value": 4318643
    },
    {
        "name": "鳩羽つぐ",
        "value": 4290228
    },
    {
        "name": "-yume-柚萌",
        "value": 4135005
    },
    {
        "name": "田中ヒメ 鈴木ヒナ",
        "value": 4039725
    },
    {
        "name": "剣持刀也",
        "value": 3784811
    },
    {
        "name": "萌恵",
        "value": 3668407
    },
    {
        "name": "物述有栖",
        "value": 3435538
    },
    {
        "name": "アズマ リム(アズリム)",
        "value": 3044629
    },
    {
        "name": "叶(かなえ)",
        "value": 2931269
    },
    {
        "name": "おめがレイ おめがリオ",
        "value": 2781646
    },
    {
        "name": "ばあちゃる",
        "value": 2589416
    },
    {
        "name": "鈴鹿詩子",
        "value": 2373786
    },
    {
        "name": "源元気",
        "value": 2367536
    },
    {
        "name": "モイラ",
        "value": 2354157
    },
    {
        "name": "甲賀流忍者 ぽんぽこ",
        "value": 2062940
    },
    {
        "name": "ンヌグム",
        "value": 1815225
    },
    {
        "name": "瀬兎一也と屍人の記録部…",
        "value": 1792511
    },
    {
        "name": "勇気ちひろ",
        "value": 1751693
    },
    {
        "name": "メイドのユキさん 調教…",
        "value": 1727076
    },
    {
        "name": "藤崎由愛(YUA)",
        "value": 1723421
    },
    {
        "name": "エルフのえる",
        "value": 1679058
    },
    {
        "name": "ヤミクモケリン",
        "value": 1675717
    },
    {
        "name": "名取さな",
        "value": 1664103
    },
    {
        "name": "鈴谷アキ",
        "value": 1616545
    },
    {
        "name": "家長むぎ",
        "value": 1613385
    },
    {
        "name": "薬袋カルテ(みないかる…",
        "value": 1590009
    },
    {
        "name": "YuNi",
        "value": 1583283
    },
    {
        "name": "ロボ子さん",
        "value": 1537466
    },
    {
        "name": "さはな",
        "value": 1522227
    },
    {
        "name": "カフェ野ゾンビ子",
        "value": 1510009
    },
    {
        "name": "森中花咲",
        "value": 1500889
    },
    {
        "name": "あっくん大魔王",
        "value": 1450288
    },
    {
        "name": "渋谷ハジメ",
        "value": 1396243
    },
    {
        "name": "響木アオ",
        "value": 1373320
    },
    {
        "name": "バーチャルネットアイド…",
        "value": 1365688
    },
    {
        "name": "虹河ラキ",
        "value": 1253975
    },
    {
        "name": "ゴールドシップ(ゴルシ)",
        "value": 1241071
    },
    {
        "name": "北上双葉",
        "value": 1168015
    },
    {
        "name": "のなか三崎",
        "value": 1134870
    },
    {
        "name": "ハッカドール",
        "value": 1133143
    },
    {
        "name": "届木ウカ",
        "value": 1106492
    },
    {
        "name": "花京院ちえり",
        "value": 1076049
    },
    {
        "name": "宇志海いちご",
        "value": 1067722
    },
    {
        "name": "夜桜たま",
        "value": 1055973
    },
    {
        "name": "もこ田めめめ",
        "value": 1030057
    },
    {
        "name": "もちひよこ",
        "value": 987437
    },
    {
        "name": "バーチャルゴリラ",
        "value": 985536
    },
    {
        "name": "のらきゃっと",
        "value": 949794
    },
    {
        "name": "万楽えね(まぐら えね)",
        "value": 917941
    },
    {
        "name": "ウェザーロイドAiri",
        "value": 900086
    },
    {
        "name": "鈴木あんず 白藤環(あ…",
        "value": 844978
    },
    {
        "name": "マグロナ",
        "value": 838410
    },
    {
        "name": "乾伸一郎(忍者)",
        "value": 837564
    },
    {
        "name": "地球ちゃん(海外)",
        "value": 830870
    },
    {
        "name": "金剛いろは",
        "value": 830522
    },
    {
        "name": "日雇礼子",
        "value": 783387
    },
    {
        "name": "ディープウェブ・アンダ…",
        "value": 758280
    },
    {
        "name": "ニーツ（VT-212）",
        "value": 756555
    },
    {
        "name": "シスター・クレア",
        "value": 728538
    },
    {
        "name": "にじさんじ",
        "value": 714855
    },
    {
        "name": "ふぇありす",
        "value": 623088
    },
    {
        "name": "東雲めぐ",
        "value": 617923
    },
    {
        "name": "カルロ・ピノ",
        "value": 594378
    },
    {
        "name": "伏見ガク",
        "value": 540443
    },
    {
        "name": "白上フブキ",
        "value": 539967
    },
    {
        "name": "ギルザレンIII世",
        "value": 448033
    },
    {
        "name": "ディープブリザード(深…",
        "value": 398687
    },
    {
        "name": "猫乃木もち",
        "value": 373542
    },
    {
        "name": "文野環",
        "value": 361041
    },
    {
        "name": "春日部つくし",
        "value": 332993
    },
    {
        "name": "藤間桜",
        "value": 332655
    },
    {
        "name": "イヴ・ヴァルレーヌ",
        "value": 326958
    },
    {
        "name": "御来屋久遠",
        "value": 278967
    },
    {
        "name": "夕陽リリ",
        "value": 275196
    },
    {
        "name": "すーぱーそに子",
        "value": 225541
    },
    {
        "name": "木曽あずき",
        "value": 213170
    },
    {
        "name": "赤羽葉子",
        "value": 211796
    },
    {
        "name": "ベイレーン",
        "value": 199755
    },
    {
        "name": "シロ(ゲーム)",
        "value": 59708
    },
    {
        "name": "滓残",
        "value": 50937
    }
];

var legendData = [
    "キズナアイ",
    "キズナアイ(ゲーム)",
    "ミライアカリ",
    "輝夜月(かぐやるな)",
    "電脳少女YouTube…",
    "ヨメミ",
    "月ノ美兎",
    "猫宮ひなた",
    "TEN",
    "ねこみみマスター(バー…",
    "富士葵(ふじあおい)",
    "ときのそら",
    "静凛",
    "バーチャルおばあちゃん…",
    "夢咲楓",
    "ピーナッツくん",
    "樋口楓",
    "Ami Yamato(…",
    "かしこまり",
    "吟醸姉妹/Ginjo …",
    "織田信姫",
    "鳩羽つぐ",
    "-yume-柚萌",
    "田中ヒメ 鈴木ヒナ",
    "剣持刀也",
    "萌恵",
    "物述有栖",
    "アズマ リム(アズリム)",
    "叶(かなえ)",
    "おめがレイ おめがリオ",
    "ばあちゃる",
    "鈴鹿詩子",
    "源元気",
    "モイラ",
    "甲賀流忍者 ぽんぽこ",
    "ンヌグム",
    "瀬兎一也と屍人の記録部…",
    "勇気ちひろ",
    "メイドのユキさん 調教…",
    "藤崎由愛(YUA)",
    "エルフのえる",
    "ヤミクモケリン",
    "名取さな",
    "鈴谷アキ",
    "家長むぎ",
    "薬袋カルテ(みないかる…",
    "YuNi",
    "ロボ子さん",
    "さはな",
    "カフェ野ゾンビ子",
    "森中花咲",
    "あっくん大魔王",
    "渋谷ハジメ",
    "響木アオ",
    "バーチャルネットアイド…",
    "虹河ラキ",
    "ゴールドシップ(ゴルシ)",
    "北上双葉",
    "のなか三崎",
    "ハッカドール",
    "届木ウカ",
    "花京院ちえり",
    "宇志海いちご",
    "夜桜たま",
    "もこ田めめめ",
    "もちひよこ",
    "バーチャルゴリラ",
    "のらきゃっと",
    "万楽えね(まぐら えね)",
    "ウェザーロイドAiri",
    "鈴木あんず 白藤環(あ…",
    "マグロナ",
    "乾伸一郎(忍者)",
    "地球ちゃん(海外)",
    "金剛いろは",
    "日雇礼子",
    "ディープウェブ・アンダ…",
    "ニーツ（VT-212）",
    "シスター・クレア",
    "にじさんじ",
    "ふぇありす",
    "東雲めぐ",
    "カルロ・ピノ",
    "伏見ガク",
    "白上フブキ",
    "ギルザレンIII世",
    "ディープブリザード(深…",
    "猫乃木もち",
    "文野環",
    "春日部つくし",
    "藤間桜",
    "イヴ・ヴァルレーヌ",
    "御来屋久遠",
    "夕陽リリ",
    "すーぱーそに子",
    "木曽あずき",
    "赤羽葉子",
    "ベイレーン",
    "シロ(ゲーム)",
    "滓残"
];

var selected = {
    "キズナアイ": true,
    "キズナアイ(ゲーム)": true,
    "ミライアカリ": true,
    "輝夜月(かぐやるな)": true,
    "電脳少女YouTube…": true,
    "ヨメミ": true,
    "月ノ美兎": true,
    "猫宮ひなた": true,
    "TEN": true,
    "ねこみみマスター(バー…": true,
    "富士葵(ふじあおい)": false,
    "ときのそら": false,
    "静凛": false,
    "バーチャルおばあちゃん…": false,
    "夢咲楓": false,
    "ピーナッツくん": false,
    "樋口楓": false,
    "Ami Yamato(…": false,
    "かしこまり": false,
    "吟醸姉妹/Ginjo …": false,
    "織田信姫": false,
    "鳩羽つぐ": false,
    "-yume-柚萌": false,
    "田中ヒメ 鈴木ヒナ": false,
    "剣持刀也": false,
    "萌恵": false,
    "物述有栖": false,
    "アズマ リム(アズリム)": false,
    "叶(かなえ)": false,
    "おめがレイ おめがリオ": false,
    "ばあちゃる": false,
    "鈴鹿詩子": false,
    "源元気": false,
    "モイラ": false,
    "甲賀流忍者 ぽんぽこ": false,
    "ンヌグム": false,
    "瀬兎一也と屍人の記録部…": false,
    "勇気ちひろ": false,
    "メイドのユキさん 調教…": false,
    "藤崎由愛(YUA)": false,
    "エルフのえる": false,
    "ヤミクモケリン": false,
    "名取さな": false,
    "鈴谷アキ": false,
    "家長むぎ": false,
    "薬袋カルテ(みないかる…": false,
    "YuNi": false,
    "ロボ子さん": false,
    "さはな": false,
    "カフェ野ゾンビ子": false,
    "森中花咲": false,
    "あっくん大魔王": false,
    "渋谷ハジメ": false,
    "響木アオ": false,
    "バーチャルネットアイド…": false,
    "虹河ラキ": false,
    "ゴールドシップ(ゴルシ)": false,
    "北上双葉": false,
    "のなか三崎": false,
    "ハッカドール": false,
    "届木ウカ": false,
    "花京院ちえり": false,
    "宇志海いちご": false,
    "夜桜たま": false,
    "もこ田めめめ": false,
    "もちひよこ": false,
    "バーチャルゴリラ": false,
    "のらきゃっと": false,
    "万楽えね(まぐら えね)": false,
    "ウェザーロイドAiri": false,
    "鈴木あんず 白藤環(あ…": false,
    "マグロナ": false,
    "乾伸一郎(忍者)": false,
    "地球ちゃん(海外)": false,
    "金剛いろは": false,
    "日雇礼子": false,
    "ディープウェブ・アンダ…": false,
    "ニーツ（VT-212）": false,
    "シスター・クレア": false,
    "にじさんじ": false,
    "ふぇありす": false,
    "東雲めぐ": false,
    "カルロ・ピノ": false,
    "伏見ガク": false,
    "白上フブキ": false,
    "ギルザレンIII世": false,
    "ディープブリザード(深…": false,
    "猫乃木もち": false,
    "文野環": false,
    "春日部つくし": false,
    "藤間桜": false,
    "イヴ・ヴァルレーヌ": false,
    "御来屋久遠": false,
    "夕陽リリ": false,
    "すーぱーそに子": false,
    "木曽あずき": false,
    "赤羽葉子": false,
    "ベイレーン": false,
    "シロ(ゲーム)": false,
    "滓残": false
};

option = {
    title : {
        text: 'VTuber播放分布（前100名）',
        subtext: '2018年7月17日 17:00:00',
        x:'center'
    },
    tooltip : {
        trigger: 'item',
        formatter: "{a} <br/>{b} : {c} ({d}%)"
    },
    legend: {
        type: 'scroll',
        orient: 'vertical',
        right: 10,
        top: 375,
        bottom: 20,
        data: legendData,
        selected: selected
    },
    series : [
        {
            name: 'VTuber',
            type: 'pie',
            radius : '55%',
            center: ['40%', '50%'],
            data: seriesData,
            itemStyle: {
                emphasis: {
                    shadowBlur: 10,
                    shadowOffsetX: 0,
                    shadowColor: 'rgba(0, 0, 0, 0.5)'
                }
            }
        }
    ]
};
;
if (option && typeof option === "object") {
    myChart.setOption(option, true);
}